#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
cloudflare_record.subdomain["npm"]: Refreshing state... [id=4ee8c88443e6f4954d11c45271a4aae6]
cloudflare_record.subdomain["sonar"]: Refreshing state... [id=d300c001b7c7821697a025fe5265af70]
cloudflare_record.subdomain["jacket"]: Refreshing state... [id=570a11101f02b42d91bfc4d54a93de9c]
cloudflare_record.subdomain["jellyfin"]: Refreshing state... [id=149efe080bda81d60f19de1f6b91f284]
cloudflare_record.subdomain["bazar"]: Refreshing state... [id=64197832f04b5e4d1da93cca474846e4]
cloudflare_record.subdomain["compartilhado"]: Refreshing state... [id=2bdb0a0a9e84fa044dae221cc7d3718b]
cloudflare_record.subdomain["sabnzbd"]: Refreshing state... [id=ae3a09288122e0fcc5d899e4c94514a4]
cloudflare_record.subdomain["readar"]: Refreshing state... [id=ff2aa02ba8de06d0fa5efa0f4ec77bfc]
cloudflare_record.subdomain["prowlarr"]: Refreshing state... [id=266ffdbc0a4c02e734d61260bb30edb6]
cloudflare_record.subdomain["comp-netdata"]: Refreshing state... [id=d6c31de59c3ef47cd66e56f07d9d141c]
cloudflare_record.subdomain["transmission"]: Refreshing state... [id=796f07e51d70cd0bbad8a50896c06750]
cloudflare_record.subdomain["portainer"]: Refreshing state... [id=e81a8186c5d0734a7345c44d0c66e571]
cloudflare_record.subdomain["minio-data"]: Refreshing state... [id=7bb0f7066b913f5987566a076c02e9de]
cloudflare_record.subdomain["minio"]: Refreshing state... [id=1a9d094afd43d35bc5d262229be7276e]
cloudflare_record.subdomain["radar"]: Refreshing state... [id=38de80d3d19bbe274e5e17c08d6a2303]
cloudflare_record.subdomain["kuma"]: Refreshing state... [id=ec93c097cd494c915ee7d7da8024134e]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.subdomain["actual"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "actual.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (sensitive value)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["wyl"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "wyl.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (sensitive value)
      + zone_id         = (sensitive value)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @guilhermewolf, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Plan`*